[
  {
    "path": "posts/2021-08-10-census-2020/",
    "title": "2020 Redistricting Data Files",
    "description": "Census and election data joined together for use in redistricting\nand voting rights analysis.",
    "author": [
      {
        "name": "Christopher T. Kenny",
        "url": {}
      },
      {
        "name": "Cory McCartan",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [],
    "contents": "\n\nAKALARAZCACOCTDEFLGAHIIAIDILINKSKYLAMAMDMEMIMNMOMSMTNCNDNENHNJNMNVNYOHOKORPARISCSDTNTXUTVAVTWAWIWVWYDCUSA\n\n\nThe ALARM Project is glad to provide precinct-level demographic and election data from the 2020 decennial census and the Voting and Election Science Team which have been tidied and joined together using 2020 precinct boundaries. Where 2020 precinct boundaries are not available, Census block-level data is provided instead, and where no VEST data is available, only demographic information is provided. Code to generate the data from these sources is included; the entire workflow is open-source and reproducible.\nGetting the data\nDownload individual states’ data below, or download a ZIP of all the data here. Our repository also contains more detailed data, as well as code and instructions for programmatic downloading, adding shapefile geometries, and other use cases.\nPlease make sure to cite the Voting and Election Science Team and the U.S. Census Bureau. Consult the license for information on modifying and sharing the data and/or code.\n2020 state data\n\n\n\n\n \n\nAlabama\n \nVTDs\n\n \n\n \nal_2020_vtd.csv\n\n\n\n\n\n \n\nAlaska\n \nVTDs\n\n \n\n \nak_2020_vtd.csv\n\n\n\n\n\n \n\nArizona\n \nVTDs\n\n \n\n \naz_2020_vtd.csv\n\n\n\n\n\n \n\nArkansas\n \nVTDs\n\n \n\n \nar_2020_vtd.csv\n\n\n\n\n\n \n\nCalifornia\n \nCensus blocks\n\n \n\n \nca_2020_block.csv\n\n\n\n\n\n \n\nColorado\n \nVTDs\n\n \n\n \nco_2020_vtd.csv\n\n\n\n\n\n \n\nConnecticut\n \nVTDs\n\n \n\n \nct_2020_vtd.csv\n\n\n\n\n\n \n\nDelaware\n \nVTDs\n\n \n\n \nde_2020_vtd.csv\n\n\n\n\n\n \n\nDistrict of Columbia\n \nVTDs\n\n \n\n \ndc_2020_vtd.csv\n\n\n\n\n\n \n\nFlorida\n \nVTDs\n\n \n\n \nfl_2020_vtd.csv\n\n\n\n\n\n \n\nGeorgia\n \nVTDs\n\n \n\n \nga_2020_vtd.csv\n\n\n\n\n\n \n\nHawaii\n \nCensus blocks\n\n \n\n \nhi_2020_block.csv\n\n\n\n\n\n \n\nIdaho\n \nVTDs\n\n \n\n \nid_2020_vtd.csv\n\n\n\n\n\n \n\nIllinois\n \nVTDs\n\n \n\n \nil_2020_vtd.csv\n\n\n\n\n\n \n\nIndiana\n \nVTDs\n\n \n\n \nin_2020_vtd.csv\n\n\n\n\n\n \n\nIowa\n \nVTDs\n\n \n\n \nia_2020_vtd.csv\n\n\n\n\n\n \n\nKansas\n \nVTDs\n\n \n\n \nks_2020_vtd.csv\n\n\n\n\n\n \n\nKentucky\n \nVTDs\n\n \n\n \nky_2020_vtd.csv\n\n\n\n\n\n \n\nLouisiana\n \nVTDs\n\n \n\n \nla_2020_vtd.csv\n\n\n\n\n\n \n\nMaine\n \nVTDs\n\n \n\n \nme_2020_vtd.csv\n\n\n\n\n\n \n\nMaryland\n \nVTDs\n\n \n\n \nmd_2020_vtd.csv\n\n\n\n\n\n \n\nMassachusetts\n \nVTDs\n\n \n\n \nma_2020_vtd.csv\n\n\n\n\n\n \n\nMichigan\n \nVTDs\n\n \n\n \nmi_2020_vtd.csv\n\n\n\n\n\n \n\nMinnesota\n \nVTDs\n\n \n\n \nmn_2020_vtd.csv\n\n\n\n\n\n \n\nMississippi\n \nVTDs\n\n \n\n \nms_2020_vtd.csv\n\n\n\n\n\n \n\nMissouri\n \nVTDs\n\n \n\n \nmo_2020_vtd.csv\n\n\n\n\n\n \n\nMontana\n \nVTDs\n\n \n\n \nmt_2020_vtd.csv\n\n\n\n\n\n \n\nNebraska\n \nVTDs\n\n \n\n \nne_2020_vtd.csv\n\n\n\n\n\n \n\nNevada\n \nVTDs\n\n \n\n \nnv_2020_vtd.csv\n\n\n\n\n\n \n\nNew Hampshire\n \nVTDs\n\n \n\n \nnh_2020_vtd.csv\n\n\n\n\n\n \n\nNew Jersey\n \nVTDs\n\n \n\n \nnj_2020_vtd.csv\n\n\n\n\n\n \n\nNew Mexico\n \nVTDs\n\n \n\n \nnm_2020_vtd.csv\n\n\n\n\n\n \n\nNew York\n \nVTDs\n\n \n\n \nny_2020_vtd.csv\n\n\n\n\n\n \n\nNorth Carolina\n \nVTDs\n\n \n\n \nnc_2020_vtd.csv\n\n\n\n\n\n \n\nNorth Dakota\n \nVTDs\n\n \n\n \nnd_2020_vtd.csv\n\n\n\n\n\n \n\nOhio\n \nVTDs\n\n \n\n \noh_2020_vtd.csv\n\n\n\n\n\n \n\nOklahoma\n \nVTDs\n\n \n\n \nok_2020_vtd.csv\n\n\n\n\n\n \n\nOregon\n \nCensus blocks\n\n \n\n \nor_2020_block.csv\n\n\n\n\n\n \n\nPennsylvania\n \nVTDs\n\n \n\n \npa_2020_vtd.csv\n\n\n\n\n\n \n\nRhode Island\n \nVTDs\n\n \n\n \nri_2020_vtd.csv\n\n\n\n\n\n \n\nSouth Carolina\n \nVTDs\n\n \n\n \nsc_2020_vtd.csv\n\n\n\n\n\n \n\nSouth Dakota\n \nVTDs\n\n \n\n \nsd_2020_vtd.csv\n\n\n\n\n\n \n\nTennessee\n \nVTDs\n\n \n\n \ntn_2020_vtd.csv\n\n\n\n\n\n \n\nTexas\n \nVTDs\n\n \n\n \ntx_2020_vtd.csv\n\n\n\n\n\n \n\nUtah\n \nVTDs\n\n \n\n \nut_2020_vtd.csv\n\n\n\n\n\n \n\nVermont\n \nVTDs\n\n \n\n \nvt_2020_vtd.csv\n\n\n\n\n\n \n\nVirginia\n \nVTDs\n\n \n\n \nva_2020_vtd.csv\n\n\n\n\n\n \n\nWashington\n \nVTDs\n\n \n\n \nwa_2020_vtd.csv\n\n\n\n\n\n \n\nWest Virginia\n \nVTDs\n\n \n\n \nwv_2020_vtd.csv\n\n\n\n\n\n \n\nWisconsin\n \nVTDs\n\n \n\n \nwi_2020_vtd.csv\n\n\n\n\n\n \n\nWyoming\n \nVTDs\n\n \n\n \nwy_2020_vtd.csv\n\n\n\n\nUsing the data\nData Format\nEach data table contains several identification columns, a set of census-derived demographic columns, and a set of VEST-derived election columns.\nGEOID20 is the unique identifier for a precinct or Census block. The state and county of the precinct or block are also provided.\nCensus variables are prefixed with pop_ or vap_, depending on whether they are for the entire population or the voting-age population. Suffixes refer to racial and ethnic categories, as follows:\n_hisp: Hispanic or Latino (of any race)\n_white: White alone, not Hispanic or Latino\n_black: Black or African American alone, not Hispanic or Latino\n_aian: American Indian and Alaska Native alone, not Hispanic or Latino\n_asian: Asian alone, not Hispanic or Latino\n_nhpi: Native Hawaiian and Other Pacific Islander alone, not Hispanic or Latino\n_other: Some Other Race alone, not Hispanic or Latino\n_two: Population of two or more races, not Hispanic or Latino\n\nElection variables consist of average vote counts for Democratic and Republican candidates. The adv_## and arv_## columns report the average vote count in the ## election, across all statewide races contested by both parties. The ndv and nrv columns further average the vote counts across all available election years. For specific statewide races, you may download the files in vest-2020/ and join them to the data using the GEOID20 column.\nMore Tools\nFor redistricting and voting rights analysis, we recommend the redist package.\nFor pre-processing and tidying data for redistricting analysis, we recommend the geomander package.\nFor more custom tabulations of the 2020 census data, we recommend the PL94171 package.\nFor general-purpose census data processing, we recommend the censable package.\nFor alternate data unaffected by Census differential privacy, you may want to consider FCC block-level estimates, available using the blockpop package.\nTechnical notes\nTo produce election data using 2020 precinct boundaries, election results were projected down to the 2010 block level using voting-age population as weights. Results for 2020 blocks were then estimated using 2010 blocks and the land-use-based crosswalk files from VEST. Finally, 2020 blocks were aggregated to 2020 precincts using the Census’ 2020 block assignment files.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-12T13:52:37-04:00",
    "input_file": "census-2020.knit.md"
  },
  {
    "path": "posts/2021-07-05-revised-das-impact/",
    "title": "Revised: Impact of the Census Disclosure Avoidance System",
    "description": "We are releasing an updated version of our analysis of the U.S. Census'\nprivacy protection system and its impacts on the redistricting process.",
    "author": [
      {
        "name": "Christopher T. Kenny",
        "url": {}
      },
      {
        "name": "Shiro Kuriwaki",
        "url": {}
      },
      {
        "name": "Cory McCartan",
        "url": {}
      },
      {
        "name": "Evan Rosenman",
        "url": {}
      },
      {
        "name": "Tyler Simko",
        "url": {}
      },
      {
        "name": "Kosuke Imai",
        "url": {}
      }
    ],
    "date": "2021-07-05",
    "categories": [],
    "contents": "\nLast month, the ALARM Project released a report examining “The Impact U.S. Census Disclosure Avoidance System on Redistricting and Voting Rights Analysis.” We thank everyone who provided us with feedback on this first version, which was written as a comment on the April 28, 2021 Demonstration Data. The Census Bureau has since updated the system parameters, and as such, we are releasing an updated version.\nRevised report: The Impact of the U.S. Census Disclosure Avoidance System on Redistricting and Voting Rights Analysis\nNotably, we expand our study of bias related to racial heterogeneity to include four new states of interest: Alabama, Delaware, Utah, and Washington. We also expand our studies of partisan and racial effects in redistricting to include more cases and provide additional information on the ranges of possible outcomes. These changes come alongside a restructuring of the paper and several smaller edits to recognize additional work focused on the new DAS methodologies used this year by the Census Bureau.With this version, we are also releasing replication data and code, available on the Harvard Dataverse.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-07-05T21:30:18-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-09-dsep-decision-response/",
    "title": "Reaction to the Census Bureau's Updated Parameters",
    "description": "The Data Stewardship Executive Policy Committee announces a higher privacy \nloss budget and other changes to the Disclosure Avoidance System.",
    "author": [
      {
        "name": "Christopher T. Kenny",
        "url": {}
      },
      {
        "name": "Shiro Kuriwaki",
        "url": {}
      },
      {
        "name": "Cory McCartan",
        "url": {}
      },
      {
        "name": "Evan Rosenman",
        "url": {}
      },
      {
        "name": "Tyler Simko",
        "url": {}
      },
      {
        "name": "Kosuke Imai",
        "url": {}
      }
    ],
    "date": "2021-06-09",
    "categories": [],
    "contents": "\nOn June 9, The Census Bureau released information on their final parameters for the 2020 Census data release. We are grateful that they have incorporated some of the recommendations from our report to help build a better data product for redistricting.\nThe Bureau has made several welcome changes. They state that they have updated the post-processing component of the Disclosure Avoidance System (DAS) to address the undercounting bias in racially and ethnically diverse areas, which we reported in our analysis. As we recommended, the Bureau has also increased the privacy-loss budget, allocating the increase towards more accurate population and racial counts on geographies at the block group level and higher. We are hopeful that this targeted increase will help attenuate the DAS- induced population change at the voting district and precinct level.\nSome unresolved issues remain, however. The Bureau indicates that a new demonstration data product will not be released until September. Yet they plan to first release 2020 census redistricting data, which we expect states and localities to begin using immediately, by August 16, 2021.1 Given the timing, it is unclear how the evaluation of the new demonstration data will affect the upcoming redistricting process and related litigation.  The Bureau also states that there will be no direct increases in accuracy for block-level data, in order to protect privacy.  As this is a key aspect of ensuring the equality of vote and protecting the principle of One Person, One Vote, map drawers and analysts may have to adjust their interpretation of this long-standing principle.\nThe Bureau also announced that they plan to release the final version of the DAS code base.  This is an important step for transparency. However, the code alone does not allow analysts to evaluate the impacts of DAS on redistricting and properly account for the additional uncertainty due to the injected noise. We recommend the Bureau also release differentially private noisy population counts that have not been subject to the post-processing steps, as well as parameter values used for noise generation. Although scholarly communities have not fully resolved the issue of incorporating additional noise into redistricting simulation analysis, the availability of such information should facilitate future methodological development. In particular, it is of interest to examine whether or not the additional noise makes it more difficult to detect partisan and racial gerrymandering.\n\nCaliper, who makes the software Maptitude for Redistricting, has announced they will process the legacy format data, and two ALARM Project members have created an R package to process legacy data as well. These types of resources should allow people to immediately begin drawing maps.↩︎\n",
    "preview": "posts/2021-06-09-dsep-decision-response/census_slide.jpg",
    "last_modified": "2021-06-09T20:36:09-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-02-das-evaluation-faq/",
    "title": "FAQ: Impact of the Census Disclosure Avoidance System",
    "description": "Answers to common questions about our recently-released report \nevaluating the Census' Disclosure Avoidance System.",
    "author": [
      {
        "name": "Christopher T. Kenny",
        "url": {}
      },
      {
        "name": "Shiro Kuriwaki",
        "url": {}
      },
      {
        "name": "Cory McCartan",
        "url": {}
      },
      {
        "name": "Evan Rosenman",
        "url": {}
      },
      {
        "name": "Tyler Simko",
        "url": {}
      },
      {
        "name": "Kosuke Imai",
        "url": {}
      }
    ],
    "date": "2021-06-02",
    "categories": [],
    "contents": "\n\nContents\nAre you advocating for the use of swapping methods over differential privacy as a method of privacy protection?\nDoes the DAS noise “cancel out” at larger geographic scales?\nWill the noisy data make it harder to create partisan gerrymanders?\nWhy is using a simulation-based method useful to assess DAS? What are the downsides?\nWhy do you use strict thresholds to define equal district population parity, thereby labelling more plans invalid?\nWhy do you use a strict threshold of 50% to define the majority-minority districts (MMDs)?\nWhy does your analysis not adjust for the differential privacy (DP) mechanism, to properly measure uncertainty?\nDo your findings about the prediction of individual race contradict the property of differential privacy?\nWhat are the differences between your analysis and MGGG’s analysis, both of which are based on simulation methods?\nWhy do you rely on Census data as the ‘ground-truth’? Doesn’t the Census itself already have enumeration error?\n\nWe have received a large number of questions and suggestions since releasing the first version of our report on Friday, May 28th. After meeting the Census Bureau’s one month deadline to produce comments on DAS-protected data, we are continuing to undertake additional analyses of the impacts of DAS on the redistricting process and analyses. We are working towards releasing the revised report soon. In the meantime, we provide our current answers to the questions frequently asked by others below.\nAre you advocating for the use of swapping methods over differential privacy as a method of privacy protection?\nNo. We have not studied the impact of swapping on redistricting. It is well known that differential privacy (DP) is theoretically superior to swapping in terms of privacy protection. The key policy question is how much privacy protection we would want at the expense of accurate census measurements. We argue that when changing an important public policy, such as whether additional noise should be added to the census, one needs to carefully determine the impacts of such policy change. We do not argue against DP and believe additional privacy protections to be a worthy consideration for some of the Census variables and products. However, we find that the current implementation of DAS can lead to substantively important changes in redistricting outcomes while also not meaningfully protecting privacy (as demonstrated by the fact that the prediction of individual race remains accurate even with the DAS data). We believe that more studies are needed to determine whether to inject noise and if so how exactly noise should be added. We hope that our study, along with many others, is the first step in answering this important question, by showing the potential consequences of the current DAS on certain redistricting outcomes.\nDoes the DAS noise “cancel out” at larger geographic scales?\nTheoretically yes, but with a caveat. The DAS is designed to have less noise at larger geographic scales, especially for levels of geography in the Census hierarchy, known as “on-spine” geographies (blocks, block groups, tracts, and counties). But geographies like Census places and voting precincts (VTDs) are “off-spine”. The design of the DAS may induce noise that does not cancel out in off-spine geographies.\nOur analysis finds that not only is there more noise for VTDs, but also that there remains a particular form of previously undiscussed bias — perhaps an unintentional side-effect of the DAS post-processing procedure needing to satisfy accuracy constraints in on-spine geographies. We find that the DAS data systematically undercounts racially and politically diverse VTDs in comparison to more homogeneous VTDs. How these discrepancies add up into legislative districts clearly depends on the spatial adjacency of diverse and homogenous VTDs. But in some cases the bias does not cancel out. In Pennsylvania, the average Congressional district changes by only 400 or so people. But the majority-Black 3rd Congressional District gains around 2,000 people under the DAS-protected data, while the more diverse 2nd Congressional District, a Black-Hispanic coalition district, loses around 2,000 people.\nWill the noisy data make it harder to create partisan gerrymanders?\nIn general, no. Partisan gerrymanders can be made with election data and voter files, both of which are not part of the Census and so will not contain any DAS-based error. Other residential and political data sources (both public and private) exist as well, which could be used to draw skewed districts. However, for analysts who must use noisy Census data to identify and analyze a potential gerrymander, the noise and the partisan biases discussed above may make it more difficult to do so.\nWhy is using a simulation-based method useful to assess DAS? What are the downsides?\nWithout the use of simulation, we are restricted to verifying changes in enacted redistricting plans. Analyzing enacted plans under a particular DAS dataset may not allow us to understand how DAS affects other similar plans. By using simulation methods, we are able to draw new maps with the DAS data under realistic constraints while taking into account the geography and spatial distributions of populations.  A downside of simulation is that the results will depend on the types of redistricting maps the algorithms are designed to generate.  More studies are needed to better understand how DAS affects different types of redistricting maps.\nWhy do you use strict thresholds to define equal district population parity, thereby labelling more plans invalid?\nThe use of strict thresholds is informed by a long series of Supreme Court decisions which establish and define the “one person, one vote” principle.  Current practice for redistricting congressional districts is to minimize the population difference across as much as possible.  As summarized by the National Conference of State Legislatures, in many states, this means getting district populations to be within a single person of one another, based on the Census counts.  If only noisy data is available, drawing districts to minimize the population difference becomes at best ambiguous.  Our analysis demonstrates the current statutory and judicial standards may not be applicable to the DAS-protected data.  On this point, our findings about the magnitude of population changes agree with many other analyses of the DAS and the April 28 Demonstration Data.  If the DAS data will be used for redistricting, the key question will be if and how to change the interpretation of “one person, one vote” principle and how such a change will affect redistricting in practice.\nWhy do you use a strict threshold of 50% to define the majority-minority districts (MMDs)?\nWe use a 50% threshold for majority minority districts to remain in line with the jurisprudence following Thornburg v. Gingles (1986). Specifically, Bartlett v. Strickland (2009) held that a minority must “constitute a numerical majority of the voting-age population in an area before §2 requires the creation of a legislative district to prevent dilution of that group’s votes.” When simulating districts, the number of districts which satisfy this specific numerical constraint is thus important. There are other ways to think about minority voting in elections, such as “opportunity districts”, “coalitional districts”, “crossover districts”, and “influence districts.” These have less concrete definitions and rely on electoral data, rather than just Census data.  Certainly, strict majorities are not the only relevant measure of minority voting power, and its coarseness makes it sensitive to change introduced by the DAS.  We find that the practice of using strict thresholds for majority minority districts may lead to biased results especially for small districts such as state legislative districts and school boards.\nWhy does your analysis not adjust for the differential privacy (DP) mechanism, to properly measure uncertainty?\nOur analysis examines the consequences of a map drawer taking DAS-protected data as-is. Ideally, analysts can also adjust for the DP mechanism into that data.  However, the Bureau’s deterministic and asymmetric post-processing procedure cannot be easily incorporated into standard redistricting analyses, preventing analysts from quantifying the added uncertainty exactly.  We recommend that the Bureau release the DP data without post-processing, allowing analysts to adjust redistricting plans with this added uncertainty. \nDo your findings about the prediction of individual race contradict the property of differential privacy?\nTechnically, no. Differential privacy guarantees that the inference based on a database does not depend on whether or not a particular individual is included in the data.  However, one might argue that for the PL94-171 data, the only sensitive information to be protected is race.  Our prediction methodology combines the census block level racial composition with the publicly available addresses and names of registered voters.  We found that our overall prediction performance does not degrade even if we use the noise-added census block data. And, yet, in our reanalysis of a recent court case where this prediction methodology was prominently used, the prediction appears to be substantively different.  We are in the process of studying when and how these differences arise.  In general, when deciding what privacy to protect at the cost of inaccurate measurements, it is important to consider the consequences of privacy disclosure.  Our finding suggests that the addition of noise to the census data does not necessarily improve the privacy protection in terms of individuals’ race.\nWhat are the differences between your analysis and MGGG’s analysis, both of which are based on simulation methods?\nThe MGGG Redistricting Lab has also released a study on using DAS data for redistricting purposes, which we believe is well done. In many ways, our results agree with those of the MGGG team. Like the MGGG study, we also find district-level population errors on the scale of hundreds or thousands of people depending on the size of the district (including Section 5 in our analysis and Figure 4 in the MGGG analysis). The core differences in these results come from interpretation. We find similarly sized errors and consider them to be major differences given that districts in many scenarios are drawn to be as exact as possible, down to individual people in many states. For example, Karcher v. Daggett (1983) found that even minute differences in population parity across congressional districts must be justified, even when smaller than the expected error in the decennial census. The MGGG team interprets their results in light of existing noise in current Census data, and say that “the practice of one-person population deviation across districts was never reasonably justified by the accuracy of Census data nor required by law.”  This implies that if DAS data are to be adopted, courts must decide how to change the interpretation of “one person, one vote” principle.\nOur analysis differs from the MGGG paper in several ways as well, and more studies are needed in order to better understand the impact of DAS on redistricting analysis and evaluation. First, our analysis relies on different data. We use the April 28th Demonstration Data, which the Census says will “closely approximate” the final data product, and span several states. The MGGG team uses the publicly available implementation of the 2018 TopDown algorithm with a reconstruction experiment to study Texas, mostly Dallas County, so our studies do not overlap in geographic areas.\nSecond, our analysis is focused on voting precincts (VTDs), which are the building blocks used in constructing redistricting plans in the vast majority of states.  Election results are also reported at this level or the state equivalent. In contrast, the MGGG analysis built districts out of Census blocks, block groups, and tracts.  These geographies are called “on-spine” by the Census bureau, since they nest within each other. Crucially, the DAS is designed to minimize error for these on-spine geographies, but not for off-spine geographies like VTDs. This may explain why our analysis finds more noise in the VTD population and racial counts than the MGGG’s analysis.\nWhy do you rely on Census data as the ‘ground-truth’? Doesn’t the Census itself already have enumeration error?\nCensus data, as acknowledged by the Bureau, has errors as well, including undercounts of some minority groups. Despite these inaccuracies, we rely on Census data for our simulations because governments and courts generally consider Census data as “ground-truth” for the purposes of drawing districts (e.g., Karcher v. Daggett 1983). The purpose of our analysis is to investigate how relying on DAS data, rather than on Census data as has generally been done in the past, may lead to different results in some cases. In an ideal world, districts drawn using DAS data would be substantively identical to those drawn with Census data. However, we find cases where districts differ by hundreds or thousands of people depending on whether one relies on the Census or DAS data. Additionally, we believe that more research is necessary to determine whether or not existing enumeration errors will cancel out the error induced by DAS, particularly for “off-spine” but substantively important geographies like VTDs.\nAs noted by other researchers, enumeration error is also substantively different from the random error injected as part of the DAS.  At small scales like Census blocks, DAS-injected noise is likely on a larger scale than enumeration error—some Census places have seen their population doubled or halved under the DAS, while such a result is unlikely with enumeration methods. As others have pointed out, this has the effect of adding a large random element on top of the more systematic enumeration errors, which tend to overcount or undercount larger areas or entire minority groups.  DAS does not remove or address these systematic errors; it only adds more error on top of them.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-02T21:58:53-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-28-census-das/",
    "title": "Impact of the Census Disclosure Avoidance System on Redistricting",
    "description": "In attempting to protect the privacy of 2020 Census respondents, the Census \nBureau has made its data unsuitable for redistricting purposes.",
    "author": [
      {
        "name": "Christopher T. Kenny",
        "url": {}
      },
      {
        "name": "Shiro Kuriwaki",
        "url": {}
      },
      {
        "name": "Cory McCartan",
        "url": {}
      },
      {
        "name": "Evan Rosenman",
        "url": {}
      },
      {
        "name": "Tyler Simko",
        "url": {}
      },
      {
        "name": "Kosuke Imai",
        "url": {}
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\nThe U.S. Census Bureau plans to protect the privacy of 2020 Census respondents through its Disclosure Avoidance System (DAS), which attempts to achieve differential privacy guarantees by adding noise to the Census data. The Bureau has asked for feedback on the adequacy of DAS-protected data for real-world purposes. The ALARM project has conducted an extensive analysis into how the DAS-protected data affects redistricting and voting rights analyses, and has submitted these findings to the Census Bureau.\nRead the report: The Impact of the U.S. Census Disclosure Avoidance System on Redistricting and Voting Rights Analysis\nAlso see: Answers to Frequently Asked Questions Added on June 2, 2021.\nA figure from the report, indicating partisan biases in the DAS-protected data.By applying redistricting simulation and analysis methods to DAS-protected 2010 Census data, we find that the protected data are not of sufficient quality for redistricting purposes. Compared to the original Census 2010 data, we find that the DAS-protected data:\nPrevent map drawers from creating districts that satisfy the One Person, One Vote principle, according to current statutory and judicial standards. Actual deviations from equal population will generally be several times larger than as reported under the DAS data. The magnitude of this problem increases for smaller districts such as state legislative districts and school boards.\nTransfer population from low-turnout, mixed-party areas to high-turnout, single-party areas. This differential bias leads to different district boundaries, which in turn implies significant and unpredictable differences in election results. The discrepancy also degrades the ability of analysts to reliably identify partisan gerrymanders.\nTransfer population from racially mixed areas to racially segregated areas. This bias effectively means racially heterogeneous areas are under-counted. The degree of racial segregation can therefore be over-estimated, which can lead to a change in the number of majority-minority districts. It also creates significant precinct-level variability, which adds substantial unpredictability to whether or not a minority voter is included in a majority-minority district.\nAlter individual-level race predictions constructed from voter names and addresses. This leads to fewer estimated minority voters and majority-minority districts in a re-analysis of a recent Voting Rights Act case, NAACP v. East Ramapo School District. At a statewide level, however, the DAS data does not curb the ability of algorithms to identify the race of voters from names and addresses. Therefore, this casts doubt on the universal privacy protection guarantee of DAS data.\nOur primary recommendation is to release Census P.L. 94-171 data without using the Disclosure Avoidance System, and instead rely on a swapping method similar to that applied to the 2010 Census data in order to protect respondent privacy.\nIf the Census Bureau decides to apply the current DAS to Census PL. 94-171 Data, we recommend increasing the privacy loss budget and allocating the increase to improving redistricting outcomes. In particular, preserving the accuracy of populations at the voting tabulation district level would be critical. The Bureau must avoid injecting noise that systematically undercounts certain racial and partisan groups in the privacy-protected data. Additional recommendations are given in the paper.\n\n\n\n",
    "preview": "posts/2021-05-28-census-das/ex_plot.png",
    "last_modified": "2021-06-05T13:07:29-04:00",
    "input_file": {},
    "preview_width": 1500,
    "preview_height": 1200
  },
  {
    "path": "posts/2021-04-02-redist-300/",
    "title": "redist 3.0",
    "description": "A major release brings new algorithms, new workflows, and significant \nusability improvements.",
    "author": [
      {
        "name": "Cory McCartan",
        "url": "https://corymccartan.github.io/"
      },
      {
        "name": "Christopher Kenny",
        "url": "https://www.christophertkenny.com/"
      }
    ],
    "date": "2021-04-07",
    "categories": [],
    "contents": "\nThe ALARM Project is excited to announce the release of redist 3.0 on CRAN. This release brings with it new algorithms and major new workflow improvements, making redistricting analysis broadly accessible to data scientists everywhere.\n\nInstall the new version with install.packages(\"redist\").\nNew Features\nThis release includes far too many changes to list comprehensively. Key improvements and new features include:\nNew tidy interface, including new redist_map and redist_plans objects\nMerge-split MCMC now available in redist_mergesplit()\nShort burst MCMC optimization now available in redist_shortburst() along with scoring functions\nImproved Flip MCMC interface and performance improvements\nNew support for larger simulation size limits\nFunctions to freeze parts of a map and extract district cores\nNew VRA constraint\nMany new plotting functions\nConsistent function and argument names\nNew partisanship and compactnes metrics\nPerformance improvements to compactness calculations\nPlan comparison and classification in compare_plans() and classify_plans()\nNew iowa dataset and cleaned-up package data\nTo begin exploring the new features, check out the new Get Started vignette.\nWorkflow Example: North Carolina\nTo demonstrate the new redist workflow, we’ll run through a basic analysis of the 2017 congressional districts of the state of North Carolina, which were struck down as an unconstitutional partisan gerrymander in 2019.\nNew workflow\n\n\nlibrary(tidyverse)\nlibrary(redist)\n\ndownload.file(\"https://github.com/alarm-redist/redist-data/raw/main/data/nc.rds\",\n              data_path <- tempfile())\nnc_shp <- readRDS(data_path) %>%\n    select(vtd:vap, el14g_uss_r:geometry)\n\n\n\nUnder the new workflow, a redistricting analysis begins with a redist_map object, which defines the basic parameters of the redistricting problem. The redist_map() constructor builds the precinct adjacency graph which is required for redistricting simulation, and stores relevant metadata, such as the desired population parity tolerance and a reference to the existing districts. It also comes with helpful plotting functions.\n\n\nnc = redist_map(nc_shp, existing_plan=cd_17, pop_tol=0.01)\nprint(nc)\n\n\nA redist_map object with 2692 units and 15 fields\nTo be partitioned into 13 districts with population between 733,499 - 1.0% and 733,499 + 1.0%\nWith geometry:\n    bbox:           xmin: 406820 ymin: 2696.2 xmax: 3070200 ymax: 1043600\n    projected CRS:  NAD83(HARN) / North Carolina (ftUS)\n# A tibble: 2,692 x 15\n   vtd       county   pop   vap el14g_uss_r el14g_uss_d el14g_uss_l\n * <chr>     <chr>  <int> <int>       <int>       <int>       <int>\n 1 3700106W  37001   1973  1505         181         182          17\n 2 3700112E  37001   3391  2503         180         271          21\n 3 3700112W  37001   2744  2156         457         481          42\n 4 3700106N  37001   4468  3167         231         466          31\n 5 37001126  37001   2038  1713         670         416          38\n 6 37001124  37001   2455  1948         491         391          33\n 7 370011210 37001   2802  2127         358         309          31\n 8 3700103N  37001   5712  4955        1063         853          53\n 9 3700102   37001   4491  3483        1246         313          62\n10 3700106E  37001   3113  2371         423         432          42\n# … with 2,682 more rows, and 8 more variables: el14g_uss_wi <int>,\n#   el14g_uss_tot <int>, cd_13 <int>, cd_17 <int>, aland10 <dbl>,\n#   awater10 <dbl>, geometry <MULTIPOLYGON [US_survey_foot]>,\n#   adj <list>\n\nplot(nc, el14g_uss_d/(el14g_uss_d+el14g_uss_r)) +\n    scale_fill_gradient2(midpoint=0.5)\n\n\n\n\nOnce we’ve created a redist_map object, we can simulate redistricting plans.\n\n\nplans = redist_smc(nc, 1000, counties=county, silent=TRUE) # 1000 plans\nprint(plans)\n\n\n1000 sampled plans and 1 reference plan with 13 districts from a 2692-unit map,\n  drawn using Sequential Monte Carlo\nWith plans resampled from weights\nPlans matrix: num [1:2692, 1:1001] 6 6 6 6 6 6 6 6 6 6 ...\n# A tibble: 13,013 x 3\n   draw  district total_pop\n   <fct>    <int>     <dbl>\n 1 cd_17        1    733323\n 2 cd_17        2    734740\n 3 cd_17        3    732627\n 4 cd_17        4    733218\n 5 cd_17        5    733879\n 6 cd_17        6    733554\n 7 cd_17        7    734750\n 8 cd_17        8    734777\n 9 cd_17        9    731507\n10 cd_17       10    736057\n# … with 13,003 more rows\n\nThe plans variable is a redist_plans object—a special container designed to make handling sets of redistricting plans painless. As the output above shows, plans contains the 1,000 samppled plans, plus the 2017 congressional districts. We can plot a few of these plans.\n\n\nredist.plot.plans(plans, draws=c(\"cd_17\", \"1\", \"2\", \"3\"), geom=nc)\n\n\n\n\nA redist_plans object makes it easy to compute plan and district summary statistics.\n\n\nplans = plans %>%\n    mutate(comp = distr_compactness(nc),\n           dem_share = group_frac(nc, el14g_uss_d, el14g_uss_d + el14g_uss_r))\nprint(plans)\n\n\n1000 sampled plans and 1 reference plan with 13 districts from a 2692-unit map,\n  drawn using Sequential Monte Carlo\nWith plans resampled from weights\nPlans matrix: num [1:2692, 1:1001] 6 6 6 6 6 6 6 6 6 6 ...\n# A tibble: 13,013 x 5\n   draw  district total_pop  comp dem_share\n   <fct>    <int>     <dbl> <dbl>     <dbl>\n 1 cd_17        1    733323 0.803     0.687\n 2 cd_17        2    734740 0.803     0.443\n 3 cd_17        3    732627 0.803     0.407\n 4 cd_17        4    733218 0.803     0.674\n 5 cd_17        5    733879 0.803     0.425\n 6 cd_17        6    733554 0.803     0.441\n 7 cd_17        7    734750 0.803     0.446\n 8 cd_17        8    734777 0.803     0.439\n 9 cd_17        9    731507 0.803     0.440\n10 cd_17       10    736057 0.803     0.419\n# … with 13,003 more rows\n\nFrom there, we can quickly generate informative plots. First we check the compactness of the generated plans, and see that they are significantly more compact than the adopted 2017 plan.\n\n\nhist(plans, comp) +\n    labs(x=\"Compactness score (higher is more compact)\")\n\n\n\n\nNext, we look at the partisan implications of the 2017 plan. We plot the two-party Democratic vote share in each district, with districts sorted by this quantity. Each dot on the plot below is a district from one simulated plan, and the red lines show the values for the 2017 plan.\n\n\nredist.plot.distr_qtys(plans, dem_share, size=0.1)\n\n\n\n\nWe see immediately that the 2017 plan packs Democratic voters into the three most Democratic districts, and cracks them in the remaining 10 districts, leading to a durable 10–3 Republican-Democratic seat split (in an election which Democrats captured 49% of the statewide two-party vote). A clear partisan gerrymander.\nStudying districts 1, 2, and 4\nIf we want to study a specific set of districts, we can quickly filter() to the relevant map area and re-run the analysis. The redist_map() object will handle all appropriate adjustments to the adjacency graph, number of districts, and population tolerance (as is visible below).\n\n\nnc_sub = filter(nc, cd_17 %in% c(1, 2, 4))\nprint(nc_sub)\n\n\nA redist_map object with 571 units and 15 fields\nTo be partitioned into 3 districts with population between 733,760 - 1.0353% and 733,760 + 0.96399%\nWith geometry:\n    bbox:           xmin: 1921600 ymin: 524880 xmax: 2784100 ymax: 1028200\n    projected CRS:  NAD83(HARN) / North Carolina (ftUS)\n# A tibble: 571 x 15\n   vtd     county   pop   vap el14g_uss_r el14g_uss_d el14g_uss_l\n * <chr>   <chr>  <int> <int>       <int>       <int>       <int>\n 1 37015C2 37015   2182  1707         174         503          13\n 2 37015M1 37015   1103   849         172         167           5\n 3 37015C1 37015   1229   986         229         184          11\n 4 37015MH 37015    992   811         146         254          12\n 5 37015W2 37015    966   764         286          47          20\n 6 37015W1 37015   7005  5703         596        1190          44\n 7 37015M2 37015   1290   983          99         239          16\n 8 37015SN 37015   1410  1025          63         327          11\n 9 37015WH 37015   1554  1274         292         262          12\n10 37015WD 37015   1409  1050          35         319           5\n# … with 561 more rows, and 8 more variables: el14g_uss_wi <int>,\n#   el14g_uss_tot <int>, cd_13 <int>, cd_17 <int>, aland10 <dbl>,\n#   awater10 <dbl>, geometry <MULTIPOLYGON [US_survey_foot]>,\n#   adj <list>\n\nplot(nc_sub)\n\n\n\n\nOn this subset, too, the adopted 2017 plan is a significant outlier.\n\n\nplans_sub = redist_smc(nc_sub, 1000, counties=county, silent=T) %>%\n    mutate(dem_share = group_frac(nc_sub, el14g_uss_d, el14g_uss_d + el14g_uss_r))\nredist.plot.distr_qtys(plans_sub, dem_share, size=0.3)\n\n\n\n\nOld workflow\nIn comparison, the old workflow required significantly more steps and manual processing.\n\n\nlibrary(tidyverse)\nlibrary(redist)\n\ndownload.file(\"https://github.com/alarm-redist/redist-data/raw/main/data/nc.rds\",\n              data_path <- tempfile())\nnc_shp <- readRDS(data_path) %>%\n    select(vtd:vap, el14g_uss_r:geometry)\n\n\n\nOnce we’ve downloaded the data, we can start by building the adjacency graph.\n\n\nadj <- redist.adjacency(nc_shp)\n\n\n\nTime to first simulation was never really the issue, however each simulation required many inputs. redist_map objects keep track of the adj, total_pop, ndists, and pop_tol arguments, but in the older version, you had to specify each of these for every simulation. One of the quirky aspects of the older version was that counties needed to be a vector with values 1:n_counties, meaning that you had to manually transform it to use it and that only worked if the counties were contiguous.\n\n\nsims <- redist.smc(adj = adj, total_pop = nc_shp$pop, ndists = 13, \n                   pop_tol = 0.01, \n                   counties = match(nc_shp$county, unique(nc_shp$county)), \n                   nsims = 1000, silent = TRUE)\n\n\n\nOnce you finished simulating, setting up plots was always a hassle, as you needed to plot both the distribution of simulations and then compute the same metric separately for the reference plan, in this case that’s the 2017 congressional districts.\n\n\nmetrics <- redist.metrics(plans = sims$plans, measure = 'DVS',\n                          rvote = nc_shp$el14g_uss_r, nc_shp$el14g_uss_d)\n\nsorted <- metrics %>% \n  group_by(draw) %>% \n  arrange(DVS,.by_group = TRUE) %>% \n  mutate(district = 1:13) %>% \n  ungroup()\n\nreference_metrics <- redist.metrics(plans = nc_shp$cd_17, \n                                    measure = 'DVS', \n                                    rvote = nc_shp$el14g_uss_r, \n                                    dvote = nc_shp$el14g_uss_d)\n\nsorted_reference <- reference_metrics %>% \n    arrange(DVS) %>% \n    mutate(district = 1:13)\n\n\n\nAnd then to plot the standard stacked boxplots, you would need to add the reference plan manually to the rest.\n\n\nsorted %>% ggplot(aes(x = district, y = DVS, group = district)) + \n  geom_boxplot() + \n  theme_minimal() + \n  labs(x = 'District, sorted by DVS') + \n  geom_segment(data = sorted_reference, size = 1,\n               aes(x = district - 0.35, xend = district + 0.35, \n                   yend = DVS, color = 'red')) + \n  scale_color_manual(name = '', values = c('red' = 'red'),\n  labels = c('ref'), guide = 'legend')\n\n\n\n\nStudying districts 1, 2, and 4\nThe steps between loading in data to your first simulation wasn’t terrible in the old version when you were working with the full map. However, when trying to work with subsets, it became messy.\nFirst you needed to subset the shape and then rebuild a new adjacency graph that only had the remaining precincts.\n\n\nsub <- nc_shp %>% filter(cd_17 %in% c(1, 2, 4))\nsub_adj <- redist.adjacency(sub)\n\n\n\nThen, if your target on the full map was 1%, you had to compute the equivalent on the subset map, as a 1% population deviation on a subset is often larger once recombined with the full map.\n\n\npop_tol <- 0.01\nsubparpop <- sum(sub$pop)/3\nparpop <- sum(nc_shp$pop)/13\n\nsub_pop_tol <-  min(abs(subparpop - parpop * (1 - pop_tol)),\n                abs(subparpop - parpop * (1 + pop_tol))) / subparpop\nsub_pop_tol\n\n\n[1] 0.0096399\n\nNow we can simulate again, but on the smaller map.\n\n\nsims_sub <- redist.smc(adj = sub_adj, total_pop = sub$pop,\n                      nsims = 1000,  ndists = 3, \n                      counties = match(sub$county, unique(sub$county)),\n                      pop_tol = sub_pop_tol, silent = TRUE)\n\n\n\nAs before, we have to compute metrics for both the reference plan and the simulated plans.\n\n\nsub_metrics <- redist.metrics(plans = sims_sub$plans, measure = 'DVS', \n                              rvote = sub$el14g_uss_r, sub$el14g_uss_d)\n\nsub_sorted <- sub_metrics %>% \n  group_by(draw) %>% \n  arrange(DVS,.by_group = TRUE) %>% \n  mutate(district = 1:3) %>% \n  ungroup()\n\nsub_reference_metrics <- redist.metrics(plans = match(sub$cd_17, \n                                                      unique(sub$cd_17)), \n                                        measure = 'DVS', \n                                        rvote = sub$el14g_uss_r, \n                                        dvote = sub$el14g_uss_d)\n\nsub_sorted_reference <- sub_reference_metrics %>%\n    arrange(DVS) %>% \n    mutate(district = 1:3)\n\n\n\nAnd finally, we can plot the metrics and manually add the reference points.\n\n\nsub_sorted %>% ggplot(aes(x = district, y = DVS, group = district)) + \n  geom_boxplot() + \n  theme_minimal() + \n  labs(x = 'District, sorted by DVS') + \n  geom_segment(data = sub_sorted_reference, size = 1,\n               aes(x = district - 0.35, xend = district + 0.35, \n                   yend = DVS, color = 'red')) + \n  scale_color_manual(name = '', values = c('red' = 'red'),\n  labels = c('ref'), guide = 'legend')\n\n\n\n\n\n\n\n",
    "preview": "posts/2021-04-02-redist-300/redist-300_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-04-07T10:58:43-04:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
